# Экспорт данных
Команда `COPY TO` позволяет напрямую экспортировать результаты запроса в указанный формат файла. Это полезно для сохранения результата запроса, который будет использоваться в других системах, или для архивирования результатов запроса.

## Экспорт в CSV

Команда `COPY TO` позволяет экспортировать результаты запроса в CSV-файл. Пример использования:

```cypher
COPY (MATCH (p:person) RETURN p.*) TO 'person.csv' (header=true);
```

В результате будет создан CSV-файл со следующими полями:

```csv
p.id|p.name|p.age
1|marko|29
2|vadas|27
4|josh|32
6|peter|35
```

Сложные типы данных, такие как вершины и рёбра, будут представлены в виде строк в формате JSON.

Доступные параметры:

| Параметр | Описание | Значение по умолчанию |
|----------|----------|------------------------|
| `HEADER` | Нужно ли добавлять строку с заголовками. | `false` |
| `DELIM` или `DELIMITER` | Символ, разделяющий поля в CSV. | `\|` |

Еще один пример:

```cypher
COPY (MATCH (:person)-[e:knows]->(:person) RETURN e) TO 'person_knows_person.csv' (header=true);
```

Этот запрос сохранит следующие данные в файл `person_knows_person.csv`:

```csv
e
{'_SRC': '0:0', '_DST': '0:1', '_LABEL': 'knows', 'weight': 0.500000}
{'_SRC': '0:0', '_DST': '0:2', '_LABEL': 'knows', 'weight': 1.000000}
```