# Match Clause

`MATCH` 句は、グラフデータベース内のパターンを検索するために使用されます。特定の条件に一致するノード、リレーションシップ、パスを見つけることができます。

## ノードのマッチング

### 単一ラベルを持つノードのマッチング

特定のラベルを持つすべてのノードを検索します。このクエリは、`person` というラベルのついたすべてのノードを返します。

```cypher
MATCH (p:person) RETURN p;
```

出力:
```
+-------------------------------------------------------+
| p                                                     |
+=======================================================+
| {_ID: 0, _LABEL: person, name: marko, age: 29} |
+-------------------------------------------------------+
| {_ID: 1, _LABEL: person, name: vadas, age: 27} |
+-------------------------------------------------------+
| {_ID: 2, _LABEL: person, name: josh, age: 32}  |
+-------------------------------------------------------+
| {_ID: 3, _LABEL: person, name: peter, age: 35} |
+-------------------------------------------------------+
```

### 複数ラベルを持つノードのマッチ

指定されたラベルのいずれかを持つノードを検索します。このクエリは、`person`または`software`のラベルを持つすべてのノードを返します。

**注意**: Neo4jとは異なり、Neugはマルチラベルノードをサポートしていません。Neo4jでは、`(p:person:software)`は`person`と`software`の両方のラベルを同時に持つノードを表します。Neugでは、この構文は`person`または`software`のいずれかのラベルを持つノードの和集合を表します。

```cypher
MATCH (p:person:software) RETURN p;
```

出力:
```
+-----------------------------------------------------------------------------+
| p                                                                           |
+=============================================================================+
| {_ID: 0, _LABEL: person, name: marko, age: 29}                       |
+-----------------------------------------------------------------------------+
| {_ID: 1, _LABEL: person, name: vadas, age: 27}                       |
+-----------------------------------------------------------------------------+
| {_ID: 2, _LABEL: person, name: josh, age: 32}                        |
+-----------------------------------------------------------------------------+
| {_ID: 3, _LABEL: person, name: peter, age: 35}                       |
+-----------------------------------------------------------------------------+
| {_ID: 72057594037927936, _LABEL: software, name: lop, lang: java}    |
+-----------------------------------------------------------------------------+
| {_ID: 72057594037927937, _LABEL: software, name: ripple, lang: java} |
+-----------------------------------------------------------------------------+
```

### 任意のラベルを持つノードのマッチ

ラベルを指定せずにノードをマッチさせます。Neug は明示的なラベルなしでのクエリをサポートしており、定義されたスキーマ制約に基づいてコンパイル時に未知のラベルを自動的に推論します。

```cypher
MATCH (p) RETURN p;
```

出力:
```
+-----------------------------------------------------------------------------+
| p                                                                           |
+=============================================================================+
| {_ID: 0, _LABEL: person, name: marko, age: 29}                       |
+-----------------------------------------------------------------------------+
| {_ID: 1, _LABEL: person, name: vadas, age: 27}                       |
+-----------------------------------------------------------------------------+
| {_ID: 2, _LABEL: person, name: josh, age: 32}                        |
+-----------------------------------------------------------------------------+
| {_ID: 3, _LABEL: person, name: peter, age: 35}                       |
+-----------------------------------------------------------------------------+
| {_ID: 72057594037927936, _LABEL: software, name: lop, lang: java}    |
+-----------------------------------------------------------------------------+
| {_ID: 72057594037927937, _LABEL: software, name: ripple, lang: java} |
+-----------------------------------------------------------------------------+
```

## 条件によるノードのマッチング

ラベル制約に加えて、プロパティベースのフィルタリング条件を指定できます。

```cypher
MATCH (p:person {name: 'marko'}) RETURN p;
```

出力:
```
+-------------------------------------------------------+
| p                                                     |
+=======================================================+
| {_ID: 0, _LABEL: person, name: marko, age: 29} |
+-------------------------------------------------------+
```

## リレーションシップのマッチング

### 単一ラベルでリレーションシップをマッチ

```cypher
MATCH (p:person)-[k:knows]->(f:person) RETURN k;
```

出力:
```
+------------------------------------------------------------------------------------------------------+
| k                                                                                                    |
+======================================================================================================+
| {_ID: 1, _LABEL: knows, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 0, _DST_ID: 1, weight: 0.5} |
+------------------------------------------------------------------------------------------------------+
| {_ID: 2, _LABEL: knows, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 0, _DST_ID: 2, weight: 1.0} |
+------------------------------------------------------------------------------------------------------+
```

### 複数のラベルを持つ Relationship のマッチ

```cypher
MATCH (p:person)-[k:knows|created]->(f) RETURN k;
```

出力:
```
+--------------------------------------------------------------------------------------------------------------------------------------+
| k                                                                                                                                    |
+======================================================================================================================================+
| {_ID: 1, _LABEL: knows, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 0, _DST_ID: 1, weight: 0.5}                                 |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 2, _LABEL: knows, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 0, _DST_ID: 2, weight: 1.0}                                 |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 1103806595072, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 0, _DST_ID: 72057594037927936, weight: 0.4} |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 1103808692224, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 2, _DST_ID: 72057594037927936, weight: 0.4} |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 1103808692225, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 2, _DST_ID: 72057594037927937, weight: 1.0} |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 1103809740800, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 3, _DST_ID: 72057594037927936, weight: 0.2} |
+--------------------------------------------------------------------------------------------------------------------------------------+
```

### 任意のラベルを持つ関係をマッチする

```cypher
MATCH (p:person)-[k]->(f) RETURN k;
```

出力:
```
+--------------------------------------------------------------------------------------------------------------------------------------+
| k                                                                                                                                    |
+======================================================================================================================================+
| {_ID: 1, _LABEL: knows, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 0, _DST_ID: 1, weight: 0.5}                                 |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 2, _LABEL: knows, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 0, _DST_ID: 2, weight: 1.0}                                 |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 1103806595072, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 0, _DST_ID: 72057594037927936, weight: 0.4} |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 1103808692224, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 2, _DST_ID: 72057594037927936, weight: 0.4} |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 1103808692225, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 2, _DST_ID: 72057594037927937, weight: 1.0} |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 1103809740800, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 3, _DST_ID: 72057594037927936, weight: 0.2} |
+--------------------------------------------------------------------------------------------------------------------------------------+
```

## 条件付きの関係性のマッチング

プロパティに基づいて関係性をフィルタリングします。

```cypher
MATCH (p:person)-[k:knows {weight: 1.0}]->(f:person) RETURN k;
```

出力:
```
+------------------------------------------------------------------------------------------------------+
| k                                                                                                    |
+======================================================================================================+
| {_ID: 2, _LABEL: knows, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 0, _DST_ID: 2, weight: 1.0} |
+------------------------------------------------------------------------------------------------------+
```

## 繰り返しパスのマッチング

Neug は可変長の繰り返しパス探索をサポートしており、これはグラフクエリにおける一般的な機能です。

### 可変長の繰り返しパスのマッチ

可変数のホップを持つパスを検索します。このクエリは、1つまたは2つのrelationshipで構成されるすべてのパスを返します。

```cypher
MATCH (p:person)-[k*1..2]->(f) RETURN k;
```

<!-- todo: output is incorrect -->

### ソース条件付きの繰り返しパスのマッチ

ソースノードのプロパティに基づいてフィルタリング条件を指定します。このクエリは、nameが'marko'のノードから始まる1ホップまたは2ホップのパスを検索します。

```cypher
MATCH (p:person {name: 'marko'})-[k*1..2]->(f) RETURN k;
```

### ターゲット条件に一致する繰り返しパスの検索

ターゲットノードのプロパティに基づいてフィルタリング条件を指定します。このクエリは、nameが'josh'であるノードで終わるパスを検索します。

```cypher
MATCH (p:person {name: 'marko'})-[k*1..2]->(f {name: 'josh'}) RETURN k;
```

出力:
```
+---------------------------------------------------------------------------------------------------------------------------------------------------+
| k                                                                                                                                                 |
+===================================================================================================================================================+
| {_ID: 2, _LABEL: person}, {_ID: 2097152, _LABEL: knows, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 2, _DST_ID: 0}, {_ID: 0, _LABEL: person} |
+---------------------------------------------------------------------------------------------------------------------------------------------------+
```

### エッジ条件付きの繰り返しパスのマッチング

[Kuzuの仕様](https://docs.kuzudb.com/cypher/query-clauses/match/#filter-recursive-relationships)を参考に、Neugもパス中の各エッジに対してプロパティフィルタリングをサポートしています。

このクエリでは、パス中の各エッジが `r.weight < 1.0` という制約を満たす必要があります。

```cypher
MATCH (p:person {name: 'marko'})-[k:knows*1..2 (r, _ | WHERE r.weight <= 1.0)]->(f:person)
Return k;
```

<!-- todo: output is incorrect -->

### トレイルパスのマッチング

`TRAIL`オプションを使用することで、繰り返しパスをさらに制限し、エッジが重複しないようにできます。これにより、パス展開のイテレーションが無限ループせずに終了することが保証されます。

```cypher
MATCH (p:person {name: 'marko'})-[k:knows* TRAIL 1..2]->(f:person)
Return k;
```

### シンプルパスのマッチ

`SIMPLE`オプションを使用することで、繰り返しパスをさらに制限し、ノードが繰り返されないことを保証して、シンプルパスの出力を確保できます。

```cypher
MATCH (p:person {name: 'marko'})-[k:knows* ACYCLIC 1..2]->(f:person)
Return k;
```

### 重みなし最短パスのマッチ

`SHORTEST`オプションを指定することで、2つの指定されたノード間の重みなし最短パスを出力します。

```cypher
MATCH (p:person {name: 'marko'})-[k:knows* SHORTEST 1..2]->(f:person {name: 'josh'})
RETURN k;
```

## マッチパターン

`MATCH` 句は、複雑なパターンマッチングをサポートしており、ノード、リレーションシップ、条件をさまざまな方法で組み合わせて、高度なグラフクエリを表現できます。

以下は、さまざまなグラフクエリベンチマークで広く使われている、典型的なグラフクエリパターンです：

- 三角形パターン（Triangle Pattern）
```
Match (a:person)-[:created]->(b:software),
      (c:person)-[:created]->(b:software),
      (a:person)-[:knows]->(c:person)
Where a.name <> b.name AND b.name <> c.name
Return count(*);
```

- 四角形パターン（Square Pattern）
```
Match (a:person)-[:created]->(b:software),
      (c:person)-[:created]->(b:software),
      (a:person)-[:knows]->(d:person),
      (c:person)<-[:knows]-(d:person)
Where a.name <> b.name AND b.name <> c.name AND c.name <> d.name
Return count(*);
```

- 長いパス（Long Path）
```
Match (a:person)-[:knows]->(b:person),
      (b:person)-[:knows]->(c:person),
      (c:person)-[:created]->(d:software),
      (d:software)<-[:created]-(e:person),
      (e:person)-[:knows]->(f:person)
Where a.name <> b.name AND b.name <> c.name 
    AND c.name <> d.name AND d.name <> e.name
Return count(*);
```

- クリークパス（Clique Path）
```
Match (a:person)-[:created]->(b:software),
      (c:person)-[:created]->(b:software),
      (a:person)-[:knows]->(d:person),
      (c:person)<-[:knows]-(d:person),
      (a:person)-[:knows]->(c:person),
      (d:person)-[:created]->(b:software)
Where a.name <> b.name AND b.name <> c.name AND c.name <> d.name
Return count(*);
```

## Optional Match

`OPTIONAL MATCH`句を使うと、グラフ内に存在する場合と存在しない場合があるパターンをマッチさせることができます。マッチしないパターンの部分については`null`が返されます。

Optional Matchの使い方は以下の通りです：

```cypher
MATCH (a:person)-[:knows]->(b:person)
OPTIONAL MATCH (b:person)-[:created]->(c:software)
RETURN a.name, b.name, c.name
```

<!-- todo: the feature is not included in current pip package -->

上記の出力結果について、各(a, b)ペアに対して：
- bがcに接続されたノードを持っている場合、すべての(a, b, c)トリプルが返されます。例えば、('marko', 'josh')の場合、対応するトリプルは{('marko', 'josh', 'lop'), ('marko', 'josh', 'ripple')}です。
- bがcに接続されたノードを持っていない場合、現在の(a,b)ペアに対してc=nullの行が保持されます。例えば、('marko', 'vadas')の場合、出力トリプルは{('marko', 'vadas', null)}です。

これがOPTIONAL MATCH句の主な目的です。つまり、オプションのパターンがマッチしなくても、メインのMATCHからの行を保持することです。