# Match 子句

`MATCH` 子句用于在图数据库中搜索模式。它允许你查找符合特定条件的节点、关系和路径。

## 匹配节点

### 匹配单个标签的节点

查找所有具有特定标签的节点。此查询返回所有标记为 `person` 的节点。

```cypher
MATCH (p:person) RETURN p;
```

输出：
```
+-------------------------------------------------------+
| p                                                     |
+=======================================================+
| {_ID: 0, _LABEL: person, name: marko, age: 29} |
+-------------------------------------------------------+
| {_ID: 1, _LABEL: person, name: vadas, age: 27} |
+-------------------------------------------------------+
| {_ID: 2, _LABEL: person, name: josh, age: 32}  |
+-------------------------------------------------------+
| {_ID: 3, _LABEL: person, name: peter, age: 35} |
+-------------------------------------------------------+
```

### 匹配多个标签的节点

查找具有指定标签中任意一个标签的节点。该查询会返回所有标记为 `person` 或 `software` 的节点。

**注意**：与 Neo4j 不同，Neug 不支持多标签节点。在 Neo4j 中，`(p:person:software)` 表示同时具有 `person` 和 `software` 标签的节点。而在 Neug 中，这种语法表示具有 `person` 或 `software` 标签的节点的并集。

```cypher
MATCH (p:person:software) RETURN p;
```

输出：
```
+-----------------------------------------------------------------------------+
| p                                                                           |
+=============================================================================+
| {_ID: 0, _LABEL: person, name: marko, age: 29}                       |
+-----------------------------------------------------------------------------+
| {_ID: 1, _LABEL: person, name: vadas, age: 27}                       |
+-----------------------------------------------------------------------------+
| {_ID: 2, _LABEL: person, name: josh, age: 32}                        |
+-----------------------------------------------------------------------------+
| {_ID: 3, _LABEL: person, name: peter, age: 35}                       |
+-----------------------------------------------------------------------------+
| {_ID: 72057594037927936, _LABEL: software, name: lop, lang: java}    |
+-----------------------------------------------------------------------------+
| {_ID: 72057594037927937, _LABEL: software, name: ripple, lang: java} |
+-----------------------------------------------------------------------------+
```

### 匹配任意标签的节点

匹配节点时无需指定标签。Neug 支持不显式声明标签的查询，并在编译期间根据定义的 schema 约束自动推断未知标签。

```cypher
MATCH (p) RETURN p;
```

输出：
```
+-----------------------------------------------------------------------------+
| p                                                                           |
+=============================================================================+
| {_ID: 0, _LABEL: person, name: marko, age: 29}                       |
+-----------------------------------------------------------------------------+
| {_ID: 1, _LABEL: person, name: vadas, age: 27}                       |
+-----------------------------------------------------------------------------+
| {_ID: 2, _LABEL: person, name: josh, age: 32}                        |
+-----------------------------------------------------------------------------+
| {_ID: 3, _LABEL: person, name: peter, age: 35}                       |
+-----------------------------------------------------------------------------+
| {_ID: 72057594037927936, _LABEL: software, name: lop, lang: java}    |
+-----------------------------------------------------------------------------+
| {_ID: 72057594037927937, _LABEL: software, name: ripple, lang: java} |
+-----------------------------------------------------------------------------+
```

## 使用条件匹配节点

除了标签约束外，你还可以指定基于属性的过滤条件。

```cypher
MATCH (p:person {name: 'marko'}) RETURN p;
```

输出：
```
+-------------------------------------------------------+
| p                                                     |
+=======================================================+
| {_ID: 0, _LABEL: person, name: marko, age: 29} |
+-------------------------------------------------------+
```

## 匹配关系

### 匹配单标签关系

```cypher
MATCH (p:person)-[k:knows]->(f:person) RETURN k;
```

输出：
```
+------------------------------------------------------------------------------------------------------+
| k                                                                                                    |
+======================================================================================================+
| {_ID: 1, _LABEL: knows, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 0, _DST_ID: 1, weight: 0.5} |
+------------------------------------------------------------------------------------------------------+
| {_ID: 2, _LABEL: knows, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 0, _DST_ID: 2, weight: 1.0} |
+------------------------------------------------------------------------------------------------------+
```

### 匹配多个标签的关系

```cypher
MATCH (p:person)-[k:knows|created]->(f) RETURN k;
```

输出：
```
+--------------------------------------------------------------------------------------------------------------------------------------+
| k                                                                                                                                    |
+======================================================================================================================================+
| {_ID: 1, _LABEL: knows, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 0, _DST_ID: 1, weight: 0.5}                                 |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 2, _LABEL: knows, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 0, _DST_ID: 2, weight: 1.0}                                 |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 1103806595072, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 0, _DST_ID: 72057594037927936, weight: 0.4} |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 1103808692224, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 2, _DST_ID: 72057594037927936, weight: 0.4} |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 1103808692225, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 2, _DST_ID: 72057594037927937, weight: 1.0} |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 1103809740800, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 3, _DST_ID: 72057594037927936, weight: 0.2} |
+--------------------------------------------------------------------------------------------------------------------------------------+
```

### 匹配任意标签的关系

```cypher
MATCH (p:person)-[k]->(f) RETURN k;
```

输出：
```
+--------------------------------------------------------------------------------------------------------------------------------------+
| k                                                                                                                                    |
+======================================================================================================================================+
| {_ID: 1, _LABEL: knows, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 0, _DST_ID: 1, weight: 0.5}                                 |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 2, _LABEL: knows, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 0, _DST_ID: 2, weight: 1.0}                                 |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 1103806595072, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 0, _DST_ID: 72057594037927936, weight: 0.4} |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 1103808692224, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 2, _DST_ID: 72057594037927936, weight: 0.4} |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 1103808692225, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 2, _DST_ID: 72057594037927937, weight: 1.0} |
+--------------------------------------------------------------------------------------------------------------------------------------+
| {_ID: 1103809740800, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 3, _DST_ID: 72057594037927936, weight: 0.2} |
+--------------------------------------------------------------------------------------------------------------------------------------+
```

## 使用条件过滤关系

根据关系的属性来过滤关系。

```cypher
MATCH (p:person)-[k:knows {weight: 1.0}]->(f:person) RETURN k;
```

输出：
```
+------------------------------------------------------------------------------------------------------+
| k                                                                                                    |
+======================================================================================================+
| {_ID: 2, _LABEL: knows, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 0, _DST_ID: 2, weight: 1.0} |
+------------------------------------------------------------------------------------------------------+
```

## 匹配重复路径

Neug 支持可变长度的重复路径探索，这是图查询中的常见功能。

### 匹配可变长度的重复路径

查找具有可变跳数的路径。此查询返回所有由 1 个或 2 个关系组成的路径。

```cypher
MATCH (p:person)-[k*1..2]->(f) RETURN k;
```

<!-- todo: output is incorrect -->

### 基于起始节点条件匹配重复路径

根据起始节点的属性指定过滤条件。此查询查找从 name 为 'marko' 的节点开始的 1 跳或 2 跳路径。

```cypher
MATCH (p:person {name: 'marko'})-[k*1..2]->(f) RETURN k;
```

### 根据目标条件匹配重复路径

基于目标节点的属性指定过滤条件。此查询查找以 name 为 'josh' 的节点结尾的路径。

```cypher
MATCH (p:person {name: 'marko'})-[k*1..2]->(f {name: 'josh'}) RETURN k;
```

输出：
```
+---------------------------------------------------------------------------------------------------------------------------------------------------+
| k                                                                                                                                                 |
+===================================================================================================================================================+
| {_ID: 2, _LABEL: person}, {_ID: 2097152, _LABEL: knows, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 2, _DST_ID: 0}, {_ID: 0, _LABEL: person} |
+---------------------------------------------------------------------------------------------------------------------------------------------------+
```

### 匹配带边界条件的重复路径

参考 [Kuzu 的规范](https://docs.kuzudb.com/cypher/query-clauses/match/#filter-recursive-relationships)，Neug 也支持在路径中的每条边上进行属性过滤。

此查询要求路径中的每条边都满足约束条件 `r.weight < 1.0`。

```cypher
MATCH (p:person {name: 'marko'})-[k:knows*1..2 (r, _ | WHERE r.weight <= 1.0)]->(f:person)
Return k;
```

<!-- todo: output is incorrect -->

### 匹配 Trail 路径

使用 `TRAIL` 选项，你可以进一步限制重复路径，确保没有边被重复访问，从而保证路径扩展迭代能够终止而不会陷入无限循环。

```cypher
MATCH (p:person {name: 'marko'})-[k:knows* TRAIL 1..2]->(f:person)
Return k;
```

### 匹配简单路径

使用 `SIMPLE` 选项，你可以进一步限制重复路径，确保没有节点被重复访问，从而保证输出的是简单路径。

```cypher
MATCH (p:person {name: 'marko'})-[k:knows* ACYCLIC 1..2]->(f:person)
Return k;
```

### 匹配无权最短路径

指定 `SHORTEST` 选项，可以输出两个给定节点之间的无权最短路径。

```cypher
MATCH (p:person {name: 'marko'})-[k:knows* SHORTEST 1..2]->(f:person {name: 'josh'})
RETURN k;
```

## Match Patterns

`MATCH` 子句支持复杂的模式匹配，可以将节点、关系和条件以各种方式组合，从而表达复杂的图查询。

以下是一些经典的图查询模式，这些模式在各种图查询基准测试中被广泛使用：

- Triangle Pattern
```
Match (a:person)-[:created]->(b:software),
      (c:person)-[:created]->(b:software),
      (a:person)-[:knows]->(c:person)
Where a.name <> b.name AND b.name <> c.name
Return count(*);
```

- Square Pattern
```
Match (a:person)-[:created]->(b:software),
      (c:person)-[:created]->(b:software),
      (a:person)-[:knows]->(d:person),
      (c:person)<-[:knows]-(d:person)
Where a.name <> b.name AND b.name <> c.name AND c.name <> d.name
Return count(*);
```

- Long Path
```
Match (a:person)-[:knows]->(b:person),
      (b:person)-[:knows]->(c:person),
      (c:person)-[:created]->(d:software),
      (d:software)<-[:created]-(e:person),
      (e:person)-[:knows]->(f:person)
Where a.name <> b.name AND b.name <> c.name 
    AND c.name <> d.name AND d.name <> e.name
Return count(*);
```

- Clique Path
```
Match (a:person)-[:created]->(b:software),
      (c:person)-[:created]->(b:software),
      (a:person)-[:knows]->(d:person),
      (c:person)<-[:knows]-(d:person),
      (a:person)-[:knows]->(c:person),
      (d:person)-[:created]->(b:software)
Where a.name <> b.name AND b.name <> c.name AND c.name <> d.name
Return count(*);
```

## Optional Match

`OPTIONAL MATCH` 子句允许你匹配图中可能存在也可能不存在的模式，对于不匹配的部分返回 `null`。

使用 Optional Match 的方法如下：

```cypher
MATCH (a:person)-[:knows]->(b:person)
OPTIONAL MATCH (b:person)-[:created]->(c:software)
RETURN a.name, b.name, c.name
```

<!-- todo: 当前 pip 包中未包含此功能 -->

在上述输出结果中，对于每一对 (a, b)：
- 如果 b 有连接的节点 c，则返回所有 (a, b, c) 三元组。例如，对于 ('marko', 'josh')，对应的三元组为 {('marko', 'josh', 'lop'), ('marko', 'josh', 'ripple')}。
- 如果 b 没有连接的节点 c，则为当前 (a,b) 对保留一行 c=null 的记录。例如，对于 ('marko', 'vadas')，输出的三元组为 {('marko', 'vadas', null)}。

这就是 OPTIONAL MATCH 子句的主要用途——即使可选模式不匹配，也要保留主 MATCH 中的行。