# Предложение WHERE

Предложение WHERE используется для дополнительной фильтрации результатов, полученных в результате предыдущих операций запроса, на основе предикатов или подзапросов. Фильтрация в основном основана на логических выражениях, которые мы подробно рассмотрим в [разделе выражений](../expression.md). Оно выводит только данные, соответствующие заданным условиям.

## Фильтрация по свойствам

В предыдущей главе мы рассмотрели, как ограничить пары ключ-значение свойств узлов и связей с помощью выражений, таких как `(a:person {name: 'marko'})`. Здесь мы дополнительно дополним, как выразить тот же эффект через предложение WHERE.

### Фильтрация по свойствам узлов
```cypher
MATCH (a:person) 
WHERE a.name = 'marko' OR a.age > 27
RETURN a.name, a.age;
```

результат:
```
+-------------+------------+
| _0_a.name   |   _0_a.age |
+=============+============+
| marko       |         29 |
+-------------+------------+
| josh        |         32 |
+-------------+------------+
| peter       |         35 |
+-------------+------------+
```

### Фильтрация по свойствам узлов/рёбер
```cypher
MATCH (a:person)-[b:knows]->(c:person) 
WHERE a.name = 'marko' AND b.weight = 1.0
RETURN a.name, b.weight;
```

результат:
```
+-------------+---------------+
| _0_a.name   |   _4_b.weight |
+=============+===============+
| marko       |             1 |
+-------------+---------------+
```

### Фильтрация по коррелированным свойствам
```cypher
MATCH (a:person)-[b:knows]->(c:person) 
WHERE a.name <> c.name AND a.age > c.age 
RETURN a.name, a.age, c.name, c.age;
```

Результат:
```
+-------------+------------+-------------+------------+
| _0_a.name   |   _0_a.age | _2_c.name   |   _2_c.age |
+=============+============+=============+============+
| marko       |         29 | vadas       |         27 |
+-------------+------------+-------------+------------+
```

## Фильтрация с NULL

Значения NULL неизбежны в процессах хранения и вычисления графовых данных. Чтобы сохранить или удалить эти значения NULL, мы можем использовать `IS NULL` или `IS NOT NULL` в предложении WHERE.

### Фильтрация данных свойств с NULL
```cypher
MATCH (a) 
WHERE a.age IS NULL 
RETURN a.name;
```

```
+-------------+
| _0_a.name   |
+=============+
| lop         |
+-------------+
| ripple      |
+-------------+
```

### Фильтрация опциональных данных с помощью NULL
```cypher
MATCH (a) 
OPTIONAL MATCH (a)-[:knows]->(b) 
WHERE b IS NULL 
RETURN a.name;
```

<!-- todo: optional match is not included in current pip package -->

### Исключение опциональных данных с помощью IS NOT NULL
```cypher
MATCH (a) 
OPTIONAL MATCH (a)-[:knows]->(b) 
WHERE b IS NOT NULL 
RETURN a.name;
```

## WHERE с подзапросами

Клаузула WHERE также может использоваться с подзапросами для выполнения более сложных операций фильтрации.

### Паттерн Exists
```cypher
MATCH (a) 
WHERE (a)-[:knows]->(b) 
RETURN a.name;
```
Этот запрос возвращает все значения `a.name`, у которых есть отношение `knows`.

### Паттерн Not Exists
```cypher
MATCH (a) 
WHERE NOT (a)-[:knows]->(b) 
RETURN a.name;
```
Этот запрос возвращает все значения `a.name`, у которых отсутствуют отношения `knows`, что эквивалентно семантике ANTI_JOIN в SQL.

<!-- todo: where subquery is unsupported yet -->